app/controllers/roles_controller.rb

  def create
    @role = Role.new(params[:role])
    if @role.save!
---
INSERT INTO "roles" ("name") VALUES('idiot')